<?php

namespace Knyaz71\Geo\Database\Seeds\Country\Russia;

use Schema;
use DB;

class Regions
{
	public function run()
	{
		if (Schema::hasTable('geo__region')) {
			if( $country = DB::table('geo__country')->where('name','=','Россия')->first() ) {
				
				$type = DB::table('geo__type')->get()->keyBy('name');

				$dataList = [
					// Республики
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-AD',		'name'=>'Адыгея',					'kladr' => '0100000000000',	'fias' => 'd8327a56-80de-4df2-815c-4f6ab1224c50',	'oktmo' => '79000000000',	'okato' => '79000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-AL',		'name'=>'Алтай',					'kladr' => '0400000000000',	'fias' => '5c48611f-5de6-4771-9695-7e36a4e7529d',	'oktmo' => '84000000000',	'okato' => '84000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-BA',		'name'=>'Башкортостан',				'kladr' => '0200000000000',	'fias' => '6f2cbfd8-692a-4ee4-9b16-067210bde3fc',	'oktmo' => '80000000000',	'okato' => '80000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-BU',		'name'=>'Бурятия',					'kladr' => '0300000000000',	'fias' => 'a84ebed3-153d-4ba9-8532-8bdf879e1f5a',	'oktmo' => '81000000000',	'okato' => '81000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-DA',		'name'=>'Дагестан',					'kladr' => '0500000000000',	'fias' => '0bb7fa19-736d-49cf-ad0e-9774c4dae09b',	'oktmo' => '82000000000',	'okato' => '82000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-IN',		'name'=>'Ингушетия',				'kladr' => '0600000000000',	'fias' => 'b2d8cd20-cabc-4deb-afad-f3c4b4d55821',	'oktmo' => '26000000000',	'okato' => '26000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KB',		'name'=>'Кабардино-Балкария',		'kladr' => '0700000000000',	'fias' => '1781f74e-be4a-4697-9c6b-493057c94818',	'oktmo' => '83000000000',	'okato' => '83000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KL',		'name'=>'Калмыкия',					'kladr' => '0800000000000',	'fias' => '491cde9d-9d76-4591-ab46-ea93c079e686',	'oktmo' => '85000000000',	'okato' => '85000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KC',		'name'=>'Карачаево-Черкесия',		'kladr' => '0900000000000',	'fias' => '61b95807-388a-4cb1-9bee-889f7cf811c8',	'oktmo' => '91000000000',	'okato' => '91000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KR',		'name'=>'Карелия',					'kladr' => '1000000000000',	'fias' => '248d8071-06e1-425e-a1cf-d1ff4c4a14a8',	'oktmo' => '86000000000',	'okato' => '86000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KO',		'name'=>'Коми',						'kladr' => '1100000000000',	'fias' => 'c20180d9-ad9c-46d1-9eff-d60bc424592a',	'oktmo' => '87000000000',	'okato' => '87000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'',			'name'=>'Крым',						'kladr' => '9100000000000',	'fias' => 'bd8e6511-e4b9-4841-90de-6bbc231a789e',	'oktmo' => '35000000000',	'okato' => '35000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-ME',		'name'=>'Марий Эл',					'kladr' => '1200000000000',	'fias' => 'de2cbfdf-9662-44a4-a4a4-8ad237ae4a3e',	'oktmo' => '88000000000',	'okato' => '88000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-MO',		'name'=>'Мордовия',					'kladr' => '1300000000000',	'fias' => '37a0c60a-9240-48b5-a87f-0d8c86cdb6e1',	'oktmo' => '89000000000',	'okato' => '89000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-SA',		'name'=>'Саха (Якутия)',			'kladr' => '1400000000000',	'fias' => 'c225d3db-1db6-4063-ace0-b3fe9ea3805f',	'oktmo' => '98000000000',	'okato' => '98000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-SE',		'name'=>'Северная Осетия — Алания',	'kladr' => '1500000000000',	'fias' => 'de459e9c-2933-4923-83d1-9c64cfd7a817',	'oktmo' => '90000000000',	'okato' => '90000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-TA',		'name'=>'Татарстан',				'kladr' => '1600000000000',	'fias' => '0c089b04-099e-4e0e-955a-6bf1ce525f1a',	'oktmo' => '92000000000',	'okato' => '92000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-TY',		'name'=>'Тыва',						'kladr' => '1700000000000',	'fias' => '026bc56f-3731-48e9-8245-655331f596c0',	'oktmo' => '93000000000',	'okato' => '93000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-UD',		'name'=>'Удмуртия',					'kladr' => '1800000000000',	'fias' => '52618b9c-bcbb-47e7-8957-95c63f0b17cc',	'oktmo' => '94000000000',	'okato' => '94000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-KK',		'name'=>'Хакасия',					'kladr' => '1900000000000',	'fias' => '8d3f1d35-f0f4-41b5-b5b7-e7cadf3e7bd7',	'oktmo' => '95000000000',	'okato' => '95000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-CE',		'name'=>'Чечня',					'kladr' => '2000000000000',	'fias' => 'de67dc49-b9ba-48a3-a4cc-c2ebfeca6c5e',	'oktmo' => '96000000000',	'okato' => '96000000000'],
						['type_id'=>$type['Республика']->id,		'iso'=>'RU-CU',		'name'=>'Чувашия',					'kladr' => '2100000000000',	'fias' => '878fc621-3708-46c7-a97f-5a13a4176b3e',	'oktmo' => '97000000000',	'okato' => '97000000000'],
					// Края
						['type_id'=>$type['Край']->id,				'iso'=>'RU-ALT',	'name'=>'Алтайский',				'kladr' => '2200000000000',	'fias' => '8276c6a1-1a86-4f0d-8920-aba34d4cc34a',	'oktmo' => '01000000000',	'okato' => '01000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-ZAB',	'name'=>'Забайкальский',			'kladr' => '7500000000000',	'fias' => 'b6ba5716-eb48-401b-8443-b197c9578734',	'oktmo' => '76000000000',	'okato' => '76000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-KAM',	'name'=>'Камчатский',				'kladr' => '4100000000000',	'fias' => 'd02f30fc-83bf-4c0f-ac2b-5729a866a207',	'oktmo' => '30000000000',	'okato' => '30000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-KDA',	'name'=>'Краснодарский',			'kladr' => '2300000000000',	'fias' => 'd00e1013-16bd-4c09-b3d5-3cb09fc54bd8',	'oktmo' => '03000000000',	'okato' => '03000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-KYA',	'name'=>'Красноярский',				'kladr' => '2400000000000',	'fias' => 'db9c4f8b-b706-40e2-b2b4-d31b98dcd3d1',	'oktmo' => '04000000000',	'okato' => '04000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-PER',	'name'=>'Пермский',					'kladr' => '5900000000000',	'fias' => '4f8b1a21-e4bb-422f-9087-d3cbf4bebc14',	'oktmo' => '57000000000',	'okato' => '57000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-PRI',	'name'=>'Приморский',				'kladr' => '2500000000000',	'fias' => '43909681-d6e1-432d-b61f-ddac393cb5da',	'oktmo' => '05000000000',	'okato' => '05000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-STA',	'name'=>'Ставропольский',			'kladr' => '2600000000000',	'fias' => '327a060b-878c-4fb4-8dc4-d5595871a3d8',	'oktmo' => '07000000000',	'okato' => '07000000000'],
						['type_id'=>$type['Край']->id,				'iso'=>'RU-KHA',	'name'=>'Хабаровский',				'kladr' => '2700000000000',	'fias' => '7d468b39-1afa-41ec-8c4f-97a8603cb3d4',	'oktmo' => '08000000000',	'okato' => '08000000000'],
					// Области
						['type_id'=>$type['Область']->id,			'iso'=>'RU-AMU',	'name'=>'Амурская',					'kladr' => '2800000000000',	'fias' => '844a80d6-5e31-4017-b422-4d9c01e9942c',	'oktmo' => '10000000000',	'okato' => '10000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-ARK',	'name'=>'Архангельская',			'kladr' => '2900000000000',	'fias' => '294277aa-e25d-428c-95ad-46719c4ddb44',	'oktmo' => '11000000000',	'okato' => '11000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-AST',	'name'=>'Астраханская',				'kladr' => '3000000000000',	'fias' => '83009239-25cb-4561-af8e-7ee111b1cb73',	'oktmo' => '12000000000',	'okato' => '12000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-BEL',	'name'=>'Белгородская',				'kladr' => '3100000000000',	'fias' => '639efe9d-3fc8-4438-8e70-ec4f2321f2a7',	'oktmo' => '14000000000',	'okato' => '14000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-BRY',	'name'=>'Брянская',					'kladr' => '3200000000000',	'fias' => 'f5807226-8be0-4ea8-91fc-39d053aec1e2',	'oktmo' => '15000000000',	'okato' => '15000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-VLA',	'name'=>'Владимирская',				'kladr' => '3300000000000',	'fias' => 'b8837188-39ee-4ff9-bc91-fcc9ed451bb3',	'oktmo' => '17000000000',	'okato' => '17000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-VGG',	'name'=>'Волгоградская',			'kladr' => '3400000000000',	'fias' => 'da051ec8-da2e-4a66-b542-473b8d221ab4',	'oktmo' => '18000000000',	'okato' => '18000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-VLG',	'name'=>'Вологодская',				'kladr' => '3500000000000',	'fias' => 'ed36085a-b2f5-454f-b9a9-1c9a678ee618',	'oktmo' => '19000000000',	'okato' => '19000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-VOR',	'name'=>'Воронежская',				'kladr' => '3600000000000',	'fias' => 'b756fe6b-bbd3-44d5-9302-5bfcc740f46e',	'oktmo' => '20000000000',	'okato' => '20000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-IVA',	'name'=>'Ивановская',				'kladr' => '3700000000000',	'fias' => '0824434f-4098-4467-af72-d4f702fed335',	'oktmo' => '24000000000',	'okato' => '24000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-IRK',	'name'=>'Иркутская',				'kladr' => '3800000000000',	'fias' => '6466c988-7ce3-45e5-8b97-90ae16cb1249',	'oktmo' => '25000000000',	'okato' => '25000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KGD',	'name'=>'Калининградская',			'kladr' => '3900000000000',	'fias' => '90c7181e-724f-41b3-b6c6-bd3ec7ae3f30',	'oktmo' => '27000000000',	'okato' => '27000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KLU',	'name'=>'Калужская',				'kladr' => '4000000000000',	'fias' => '18133adf-90c2-438e-88c4-62c41656de70',	'oktmo' => '29000000000',	'okato' => '29000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KEM',	'name'=>'Кемеровская',				'kladr' => '4200000000000',	'fias' => '393aeccb-89ef-4a7e-ae42-08d5cebc2e30',	'oktmo' => '32000000000',	'okato' => '32000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KIR',	'name'=>'Кировская',				'kladr' => '4300000000000',	'fias' => '0b940b96-103f-4248-850c-26b6c7296728',	'oktmo' => '33000000000',	'okato' => '33000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KOS',	'name'=>'Костромская',				'kladr' => '4400000000000',	'fias' => '15784a67-8cea-425b-834a-6afe0e3ed61c',	'oktmo' => '34000000000',	'okato' => '34000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KGN',	'name'=>'Курганская',				'kladr' => '4500000000000',	'fias' => '4a3d970f-520e-46b9-b16c-50d4ca7535a8',	'oktmo' => '37000000000',	'okato' => '37000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-KRS',	'name'=>'Курская',					'kladr' => '4600000000000',	'fias' => 'ee594d5e-30a9-40dc-b9f2-0add1be44ba1',	'oktmo' => '38000000000',	'okato' => '38000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-LEN',	'name'=>'Ленинградская',			'kladr' => '4700000000000',	'fias' => '6d1ebb35-70c6-4129-bd55-da3969658f5d',	'oktmo' => '41000000000',	'okato' => '41000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-LIP',	'name'=>'Липецкая',					'kladr' => '4800000000000',	'fias' => '1490490e-49c5-421c-9572-5673ba5d80c8',	'oktmo' => '42000000000',	'okato' => '42000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-MAG',	'name'=>'Магаданская',				'kladr' => '4900000000000',	'fias' => '9c05e812-8679-4710-b8cb-5e8bd43cdf48',	'oktmo' => '44000000000',	'okato' => '44000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-MOS',	'name'=>'Московская',				'kladr' => '5000000000000',	'fias' => '29251dcf-00a1-4e34-98d4-5c47484a36d4',	'oktmo' => '46000000000',	'okato' => '46000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-MUR',	'name'=>'Мурманская',				'kladr' => '5100000000000',	'fias' => '1c727518-c96a-4f34-9ae6-fd510da3be03',	'oktmo' => '47000000000',	'okato' => '47000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-NIZ',	'name'=>'Нижегородская',			'kladr' => '5200000000000',	'fias' => '88cd27e2-6a8a-4421-9718-719a28a0a088',	'oktmo' => '22000000000',	'okato' => '22000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-NGR',	'name'=>'Новгородская',				'kladr' => '5300000000000',	'fias' => 'e5a84b81-8ea1-49e3-b3c4-0528651be129',	'oktmo' => '49000000000',	'okato' => '49000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-NVS',	'name'=>'Новосибирская',			'kladr' => '5400000000000',	'fias' => '1ac46b49-3209-4814-b7bf-a509ea1aecd9',	'oktmo' => '50000000000',	'okato' => '50000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-OMS',	'name'=>'Омская',					'kladr' => '5500000000000',	'fias' => '05426864-466d-41a3-82c4-11e61cdc98ce',	'oktmo' => '52000000000',	'okato' => '52000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-ORE',	'name'=>'Оренбургская',				'kladr' => '5600000000000',	'fias' => '8bcec9d6-05bc-4e53-b45c-ba0c6f3a5c44',	'oktmo' => '53000000000',	'okato' => '53000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-ORL',	'name'=>'Орловская',				'kladr' => '5700000000000',	'fias' => '5e465691-de23-4c4e-9f46-f35a125b5970',	'oktmo' => '54000000000',	'okato' => '54000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-PNZ',	'name'=>'Пензенская',				'kladr' => '5800000000000',	'fias' => 'c99e7924-0428-4107-a302-4fd7c0cca3ff',	'oktmo' => '56000000000',	'okato' => '56000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-PSK',	'name'=>'Псковская',				'kladr' => '6000000000000',	'fias' => 'f6e148a1-c9d0-4141-a608-93e3bd95e6c4',	'oktmo' => '58000000000',	'okato' => '58000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-ROS',	'name'=>'Ростовская',				'kladr' => '6100000000000',	'fias' => 'f10763dc-63e3-48db-83e1-9c566fe3092b',	'oktmo' => '60000000000',	'okato' => '60000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-RYA',	'name'=>'Рязанская',				'kladr' => '6200000000000',	'fias' => '963073ee-4dfc-48bd-9a70-d2dfc6bd1f31',	'oktmo' => '61000000000',	'okato' => '61000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-SAM',	'name'=>'Самарская',				'kladr' => '6300000000000',	'fias' => 'df3d7359-afa9-4aaa-8ff9-197e73906b1c',	'oktmo' => '36000000000',	'okato' => '36000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-SAR',	'name'=>'Саратовская',				'kladr' => '6400000000000',	'fias' => 'df594e0e-a935-4664-9d26-0bae13f904fe',	'oktmo' => '63000000000',	'okato' => '63000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-SAK',	'name'=>'Сахалинская',				'kladr' => '6500000000000',	'fias' => 'aea6280f-4648-460f-b8be-c2bc18923191',	'oktmo' => '64000000000',	'okato' => '64000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-SVE',	'name'=>'Свердловская',				'kladr' => '6600000000000',	'fias' => '92b30014-4d52-4e2e-892d-928142b924bf',	'oktmo' => '65000000000',	'okato' => '65000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-SMO',	'name'=>'Смоленская',				'kladr' => '6700000000000',	'fias' => 'e8502180-6d08-431b-83ea-c7038f0df905',	'oktmo' => '66000000000',	'okato' => '66000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-TAM',	'name'=>'Тамбовская',				'kladr' => '6800000000000',	'fias' => 'a9a71961-9363-44ba-91b5-ddf0463aebc2',	'oktmo' => '68000000000',	'okato' => '68000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-TVE',	'name'=>'Тверская',					'kladr' => '6900000000000',	'fias' => '61723327-1c20-42fe-8dfa-402638d9b396',	'oktmo' => '28000000000',	'okato' => '28000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-TOM',	'name'=>'Томская',					'kladr' => '7000000000000',	'fias' => '889b1f3a-98aa-40fc-9d3d-0f41192758ab',	'oktmo' => '69000000000',	'okato' => '69000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-TUL',	'name'=>'Тульская',					'kladr' => '7100000000000',	'fias' => 'd028ec4f-f6da-4843-ada6-b68b3e0efa3d',	'oktmo' => '70000000000',	'okato' => '70000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-TYU',	'name'=>'Тюменская',				'kladr' => '7200000000000',	'fias' => '54049357-326d-4b8f-b224-3c6dc25d6dd3',	'oktmo' => '71000000000',	'okato' => '71000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-ULY',	'name'=>'Ульяновская',				'kladr' => '7300000000000',	'fias' => 'fee76045-fe22-43a4-ad58-ad99e903bd58',	'oktmo' => '73000000000',	'okato' => '73000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-CHE',	'name'=>'Челябинская',				'kladr' => '7400000000000',	'fias' => '27eb7c10-a234-44da-a59c-8b1f864966de',	'oktmo' => '75000000000',	'okato' => '75000000000'],
						['type_id'=>$type['Область']->id,			'iso'=>'RU-YAR',	'name'=>'Ярославская',				'kladr' => '7600000000000',	'fias' => 'a84b2ef4-db03-474b-b552-6229e801ae9b',	'oktmo' => '78000000000',	'okato' => '78000000000'],
					// Автономная область
						['type_id'=>$type['Автономная область']->id,'iso'=>'RU-YEV',	'name'=>'Еврейская',				'kladr' => '7900000000000',	'fias' => '1b507b09-48c9-434f-bf6f-65066211c73e',	'oktmo' => '99000000000',	'okato' => '99000000000'],
					// Автономные округа
						['type_id'=>$type['Автономный округ']->id,	'iso'=>'RU-NEN',	'name'=>'Ненецкий',					'kladr' => '8300000000000',	'fias' => '89db3198-6803-4106-9463-cbf781eff0b8',	'oktmo' => '',				'okato' => '11100000000'],
						['type_id'=>$type['Автономный округ']->id,	'iso'=>'RU-KHM',	'name'=>'Ханты-Мансийский — Югра',	'kladr' => '8600000000000',	'fias' => 'd66e5325-3a25-4d29-ba86-4ca351d9704b',	'oktmo' => '',				'okato' => '71100000000'],
						['type_id'=>$type['Автономный округ']->id,	'iso'=>'RU-CHU',	'name'=>'Чукотский',				'kladr' => '8700000000000',	'fias' => 'f136159b-404a-4f1f-8d8d-d169e1374d5c',	'oktmo' => '77000000000',	'okato' => '77000000000'],
						['type_id'=>$type['Автономный округ']->id,	'iso'=>'RU-YAN',	'name'=>'Ямало-Ненецкий',			'kladr' => '8900000000000',	'fias' => '826fa834-3ee8-404f-bdbc-13a5221cfb6e',	'oktmo' => '',				'okato' => '71140000000'],
				];

				foreach ($dataList as $data) {
					DB::table('geo__region')
						->updateOrInsert(
							[
								'country_id'=> $country->id,
								'type_id'	=> $data['type_id'],
								'name'		=> $data['name'],
							],
							$data
						);
				}
			}
		}
	}
}
